# Development Workshop : #1-Opt

# Challenge: NFL Salaries

Description:

The dataset contains the salaries for the top 100 players for each position for the years 2011-2018.

1) Initial Data Setup
  +  Clean the column names of all columns by converting them to all lower case

In [1]:
import pandas as pd
import numpy as np

salaries_df = pd.read_excel('~/Downloads/nfl_salaries.xlsx')

salaries_df.columns = salaries_df.columns.str.lower().str.replace(' ', '_')

salaries_df

,year,cornerback,defensive_lineman,linebacker,offensive_lineman,quarterback,running_back,safety,special_teamer,tight_end,wide_receiver
0,2011,11265916,17818000,16420000,15960000,17228125.0,12955000,8871428,4300000.0,8734375,16250000
1,2011,11000000,16200000,15623000,12800000,16000000.0,10873833,8787500,3725000.0,8591000,14175000
2,2011,10000000,12476000,11825000,11767500,14400000.0,9479000,8282500,3556176.0,8290000,11424000
3,2011,10000000,11904706,10083333,10358200,14100000.0,7700000,8000000,3500000.0,7723333,11415000
4,2011,10000000,11762782,10020000,10000000,13510000.0,7500000,7804333,3250000.0,6974666,10800000
...,...,...,...,...,...,...,...,...,...,...,...
795,2018,778040,2464486,1600000,3397541,NaN,630000,705000,480000.0,624125,1396083
796,2018,777655,2431250,1568082,3208333,NaN,630000,705000,480000.0,611847,1333334
797,2018,771432,2422392,1533333,3000000,NaN,630000,705000,480000.0,570000,1161537
798,2018,768357,2345618,1519788,2990994,NaN,630000,655089,480000.0,561666,1150000
799,2018,767782,2321939,1500000,2967263,NaN,630000,655089,480000.0,559000,953585

2) What is the average salary for quarterbacks (Columnname : Quarterback) by year?

In [23]:
(
    salaries_df
    [['year', 'quarterback']]
    .dropna(subset = ['quarterback'])
    .assign(quarterback = lambda x: x.quarterback.astype('Int64'))
    .groupby('year', as_index = False)
    .agg(avg_salary = ('quarterback', 'mean'))
)

   year    avg_salary
0  2011  3.376113e+06
1  2012  3.496408e+06
2  2013  3.450185e+06
3  2014  4.234160e+06
4  2015  4.225789e+06
5  2016  5.499939e+06
6  2017  5.329727e+06
7  2018  6.593769e+06

3) What is the average salary by year for each position, excludes special teamers (Columnname : Special Teamer)?
  +  Hint: Transpose the dataset into "long" format to help with this step.
  
4) Convert the average salary by year for each position to a string prefixed with $ (e.g. 100000 becomes $100000)

In [26]:
(
    salaries_df
    .drop('special_teamer', 1)
    .melt('year', var_name = 'position', value_name = 'dollars')
    .dropna()
    .groupby(['year', 'position'], as_index = False)
    .agg(avg_salary = ('dollars', 'mean'))
    .assign(avg_salary = lambda x: '$' + x.avg_salary.round(0).astype('Int64').astype('string'))
)

    year           position avg_salary
0   2011         cornerback   $3037766
1   2011  defensive_lineman   $4306995
2   2011         linebacker   $4016045
3   2011  offensive_lineman   $4662748
4   2011        quarterback   $3376113
..   ...                ...        ...
67  2018        quarterback   $6593769
68  2018       running_back   $1993701
69  2018             safety   $3296868
70  2018          tight_end   $2533899
71  2018      wide_receiver   $5627721

[72 rows x 3 columns]